---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotUnlinkFile
source: html/7fef6fe0-1536-68e0-76c8-f3a4ed783e85.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LinkFailures.CannotUnlinkFile Property

Can't unlink file.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUnlinkFile { get; }
```